constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    out
    {
        type            patch;
        nFaces          190;
        startFace       122260;
    }
    sym1
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          290;
        startFace       122450;
    }
    sym2
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          290;
        startFace       122740;
    }
    in
    {
        type            patch;
        nFaces          190;
        startFace       123030;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       123220;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          61400;
        startFace       123340;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          61400;
        startFace       184740;
    }
)

// ************************************************************************* //
